docs/physics/climate-models.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 12:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Climate Models</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Climate Models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-04940609-76d9-4e10-a059-e90a8653e24e">1. Energy Balance Model</a>
<ul>
<li><a href="#h-2160090c-2385-4019-8d3a-271f4df557e2">1.1. Stochastic Feedback</a>
<ul>
<li><a href="#h-f14270fb-f0ba-433a-9cfc-8f22d6b401c8">1.1.1. Integration factor</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-45d12e4c-ee96-4676-ae57-d742cbc9116c">2. Earth System Models of Intermediate Complexity (EMICs)</a></li>
<li><a href="#h-b64a4870-5329-43e5-9aff-d780aff16c90">3. General Circulation Model</a></li>
<li><a href="#h-0ecc77db-ed3d-49b5-bfea-9d77869bc77a">4. References</a>
<ul>
<li><a href="#h-8d664cf1-5e9a-4630-b3e4-0e24cbec7994">4.1. Energy Balance Models</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-04940609-76d9-4e10-a059-e90a8653e24e" class="outline-2">
<h2 id="h-04940609-76d9-4e10-a059-e90a8653e24e"><span class="section-number-2">1</span> Energy Balance Model</h2>
<div class="outline-text-2" id="text-h-04940609-76d9-4e10-a059-e90a8653e24e">
<p>
Typically using a zero-dimensional model via Stefan-Boltzmann
equation and empirical parameters. This can be made more
complicated with 1-dimensional or 2-dimensional models, assuming
the energy budget changes with latitude and/or longitude.
</p>

<p>
Using Stefan-Boltzmann's law, we would have something like
</p>
\begin{equation}
C\frac{\D T(t)}{\D t} = R - \varepsilon\sigma T(t)^{4}
\end{equation}
<p>
where:
</p>
<ul class="org-ul">
<li>\(C\) is the effective heat capacity of the Earth (apparently
\(C\approx2.08\times10^{8}J K^{-1}m^{-2}\))</li>
<li>\(R\approx 231.4 W/m^{2}\) is net solar influx,</li>
<li>\(\varepsilon\) is the emissivity of the Earth, a unitless number
between 0 (perfectly reflective) and 1 (blackbody), for the Earth it's
somewhere in between 0.6 and 1 (<a href="https://www.jpl.nasa.gov/spaceimages/details.php?id=PIA18833">NASA</a>)&#x2026;we could use
\(\sqrt{0.6}\approx 0.7745\) as an estimate.</li>
<li>\(\sigma\) is the Stefan-Boltzmann constant,</li>
<li>\(T(t)\) is the temperature of the Earth at time \(t\).</li>
</ul>

<p>
We can treat \(T(t) = T_{0} + \Delta T(t)\) where \(T_{0}\) is constant
(using <a href="climate/effective-temperature.html">the Effective Temperature</a> of the Earth for \(T_{0}\approx 278 K\)),
then to first order we in \(\Delta T\) we have
</p>

\begin{equation}
C\frac{\D\Delta T(t)}{\D t}
= R - \varepsilon\sigma 4T_{0}^{3}\,\Delta T(t).
\end{equation}

<p>
(Note: \(4\sigma T_{0}^{3}\approx 4.873\), which is about 47.5 times
smaller than \(R\).)
This has the general solution
</p>

\begin{equation}
\Delta T(t) = \frac{R}{4\varepsilon\sigma CT_{0}^{3}} + c_{0}\exp(-4\varepsilon\sigma CT_{0}^{3}(t-t_{0}))
\end{equation}

<p>
where \(c_{0}\) is some integration constant. If we had some initial
condition, like \(T(t_{0}) = T_{0}\), then we could determine \(c_{0}\).
Taking \(T(t_{0}) = T_{0}\), we find
</p>

\begin{equation}
\Delta T(t) = \frac{R}{4\varepsilon\sigma CT_{0}^{3}}\left(1 - \exp(-4\varepsilon\sigma CT_{0}^{3}(t-t_{0}))\right)
\end{equation}

<p>
so \(\Delta T(t_{0}) = 0\), and as \(t\to\infty\) we see
\(\Delta T(t)\to R/4\varepsilon\sigma CT_{0}^{3}\) is strictly increasing.
</p>
</div>

<div id="outline-container-h-2160090c-2385-4019-8d3a-271f4df557e2" class="outline-3">
<h3 id="h-2160090c-2385-4019-8d3a-271f4df557e2"><span class="section-number-3">1.1</span> Stochastic Feedback</h3>
<div class="outline-text-3" id="text-h-2160090c-2385-4019-8d3a-271f4df557e2">
<p>
The first modification to Stefan-Boltzmann's law is to consider a
system of coupled stochastic differential equations accounting for
the concentration of greenhouse gases \(c(t)\):
</p>
\begin{equation}
\rho C_{P}H \frac{\D T(t)}{\D t} \sim R(c) - \sigma(1 - g(c)) T(t)^{4} + \widehat{f}_{T}(t)
\end{equation}
<p>
where now:
</p>
<ul class="org-ul">
<li>\(\rho\) is the density of atmosphere</li>
<li>\(C_{P}\) is specific heat</li>
<li>\(H\) is the depth of the atmosphere</li>
<li>\(g(c)\) is the feedback parameter (modifying the Stefan-Boltzmann
law)</li>
<li>\(\widehat{f}_{T}(t)\) is a Gaussian forcing term, representing
fast uncorrelated changes in temperature</li>
</ul>

<p>
We also have
</p>
\begin{equation}
\tau_{c}\frac{\D c(t)}{\D t} = -c(t)+\widehat{q}(t) + \widehat{f}_{c}(t)
\end{equation}
<p>
where
</p>
<ul class="org-ul">
<li>\(q\) is the addition of greenhouse gases per unit volume to the atmosphere</li>
<li>\(f_{c}(t)\)</li>
<li>\(\tau_{c}\) is some appropriate scaling constant</li>
</ul>

<p>
These equations crop up repeatedly in climate science. See, for
example:
</p>

<ul class="org-ul">
<li>L. Mahadevan and J.M. Deutch, "Influence of feedback on the
stochastic evolution of simple climate systems".
<i>Proc. of Royal Soc. A</i> (2009) <a href="http://web.mit.edu/chemistry/deutch/technical/pdf15/151ProcRSocA-online%282009%29.pdf">Eprint</a></li>
</ul>

<p>
The argument is that the probability distributions of important
climate variables have fat tails, such that the their expected
values do not exist.
</p>

<div class="puzzle" id="org5178109">
<p>
Can full-fledged general circulation models reproduce this result?
(It remains an open problem.)
</p>

</div>
</div>

<div id="outline-container-h-f14270fb-f0ba-433a-9cfc-8f22d6b401c8" class="outline-4">
<h4 id="h-f14270fb-f0ba-433a-9cfc-8f22d6b401c8"><span class="section-number-4">1.1.1</span> Integration factor</h4>
<div class="outline-text-4" id="text-h-f14270fb-f0ba-433a-9cfc-8f22d6b401c8">
<p>
For the second equation, we may write
</p>
\begin{equation}
\frac{\D c(t)}{\D t} + \frac{1}{\tau_{c}}c(t)
= \frac{\widehat{q}(t) + \widehat{f}_{c}(t)}{\tau_{c}}
\end{equation}
<p>
Multiplying through by a multiplication factor \(\mu(t)\)
</p>
\begin{equation}
\mu(t)\frac{\D c(t)}{\D t} + \frac{\mu(t)}{\tau_{c}}c(t)
= \mu(t)\frac{\widehat{q}(t) + \widehat{f}_{c}(t)}{\tau_{c}}
\end{equation}
<p>
If we then let
</p>
\begin{equation}
\mu(t) = \exp(t/\tau_{c})
\end{equation}
<p>
we necessarily would have
</p>
\begin{equation}
e^{-t/\tau_{c}}\frac{\D}{\D t}(e^{t/\tau_{c}}c(t))
= \frac{\widehat{q}(t) + \widehat{f}_{c}(t)}{\tau_{c}}.
\end{equation}
<p>
This doesn't get us very far, however. We would have
</p>
\begin{equation}
e^{t/\tau_{c}}c(t) - e^{t_{0}/\tau_{c}}c(t_{0})
\sim\frac{1}{\tau_{c}}\int e^{t/\tau_{c}}\widehat{q}(t)\,\D t
\end{equation}
<p>
ignoring the gaussian noise term.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-h-45d12e4c-ee96-4676-ae57-d742cbc9116c" class="outline-2">
<h2 id="h-45d12e4c-ee96-4676-ae57-d742cbc9116c"><span class="section-number-2">2</span> Earth System Models of Intermediate Complexity (EMICs)</h2>
<div class="outline-text-2" id="text-h-45d12e4c-ee96-4676-ae57-d742cbc9116c">
<p>
Basically, everything in between the simplest "Energy Balance"
model and the most complicated "General Circulation" model.
</p>
</div>
</div>

<div id="outline-container-h-b64a4870-5329-43e5-9aff-d780aff16c90" class="outline-2">
<h2 id="h-b64a4870-5329-43e5-9aff-d780aff16c90"><span class="section-number-2">3</span> General Circulation Model</h2>
<div class="outline-text-2" id="text-h-b64a4870-5329-43e5-9aff-d780aff16c90">
<p>
The most complicated sort of model, the Cadillac of climate models.
It models climate using the Navier-Stokes equation. As we do not
have a solution to the NS equation, we are forced to do a lot of
difficult numerical analysis, and that sucks.
</p>
</div>
</div>


<div id="outline-container-h-0ecc77db-ed3d-49b5-bfea-9d77869bc77a" class="outline-2">
<h2 id="h-0ecc77db-ed3d-49b5-bfea-9d77869bc77a"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-h-0ecc77db-ed3d-49b5-bfea-9d77869bc77a">
<ul class="org-ul">
<li>L. Mahadevan and J.M. Deutch, "Influence of feedback on the
stochastic evolution of simple climate systems".
<i>Proc. of Royal Soc. A</i> (2009) <a href="http://web.mit.edu/chemistry/deutch/technical/pdf15/151ProcRSocA-online%282009%29.pdf">Eprint</a></li>
<li>J. David Neelin,
<cite class="book-title">Climate Change and Climate Modeling</cite>.
Cambridge University Press, 2011.</li>
</ul>
</div>

<div id="outline-container-h-8d664cf1-5e9a-4630-b3e4-0e24cbec7994" class="outline-3">
<h3 id="h-8d664cf1-5e9a-4630-b3e4-0e24cbec7994"><span class="section-number-3">4.1</span> Energy Balance Models</h3>
<div class="outline-text-3" id="text-h-8d664cf1-5e9a-4630-b3e4-0e24cbec7994">
<ul class="org-ul">
<li><a href="https://www.e-education.psu.edu/meteo469/node/135">Modeling of the Climate System</a>, PSU Meteo 469, Lesson 4,</li>
<li><a href="https://www.e-education.psu.edu/meteo469/node/137">Simple Climate Models</a>, PSU Meteo 469</li>
<li><a href="https://ocw.mit.edu/courses/earth-atmospheric-and-planetary-sciences/12-810-dynamics-of-the-atmosphere-spring-2008/">Dynamics of the Atmosphere</a>, MIT OCW course 12.810</li>
<li><a href="https://www.acs.org/content/acs/en/climatescience/atmosphericwarming/singlelayermodel.html">A Single-Layer Atmosphere Model</a>, ACS</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-04-11 Sun 11:57.</p>
</div>
</body>
</html>